app/controllers/dispatch_controller.rb

SELECT "rides".* FROM "rides"
---
def index
	@rides = Ride.all