app/views/rides/_form.html.erb

  <!-- <input id="pickups" class="text_field"> -->
  <%= f.select :pickup_location_id, Location.all.order(:name).map{|l| [l.name, l.id]}, class: "selectpicker" %>
---
SELECT "locations".* FROM "locations"   ORDER BY "locations"."name" ASC